andrew-2.3.1/run/tutorials/heatTransfer/buoyantSimpleFoam/hotRadiationRoom/constant/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation on;

radiationModel  P1;

// Number of flow iterations per radiation iteration
solverFreq 1;

absorptionEmissionModel constantAbsorptionEmission;

constantAbsorptionEmissionCoeffs
{
    absorptivity    absorptivity    [ 0 -1 0 0 0 0 0 ] 0.5;
    emissivity      emissivity      [ 0 -1 0 0 0 0 0 ] 0.5;
    E               E               [ 1 -1 -3 0 0 0 0 ] 0;
}

scatterModel    none;

sootModel       none;


// ************************************************************************* //
